УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/CommonModules/смарт_ОбменКонтрагентамиУТКовчегСервер/Module.bsl
//В этой функции задаются параметры для подключения
Функция ПараметрыПодключенияКВебСервису()
	П = Новый Структура;
	П.Вставить("WSСсылка", WSСсылки.смарт_WSСсылкаОбменПартнерамиСУТКовчег);
	П.Вставить("ПространствоИмен", "http://sdb/SmartExchangePartner");
	П.Вставить("ИмяСервиса", "SmartExchangePartner");
	П.Вставить("ИмяПорта", "SmartExchangePartnerSoap");
	
	//данные для авторизации
	П.Вставить("Логин", "Администратор");
	П.Вставить("Пароль", "19320998");
	
	Возврат П;
КонецФункции

Функция ВыгрузитьПартнера(Партнер) Экспорт
	ПараметрыПодключения = ПараметрыПодключенияКВебСервису();
	
	Соединение = ПараметрыПодключения.WSСсылка.СоздатьWSПрокси(ПараметрыПодключения.ПространствоИмен, ПараметрыПодключения.ИмяСервиса, ПараметрыПодключения.ИмяПорта);
	Соединение.Пользователь = ПараметрыПодключения.Логин;
	Соединение.Пароль = ПараметрыПодключения.Пароль;
	
	СтруктураВыгрузка = ПолучитьСтруктуруДляВыгрузки(Партнер);
	
	Ответ = Соединение.Exchange(Сериализовать(СтруктураВыгрузка));
	
	СтруктураОтвет = Десериализовать(Ответ);
	
	//показ сообщений
	Для каждого стр_сообщения из СтруктураОтвет.ТЗИнформация цикл
		Сообщить(стр_сообщения.Сообщение);
	КонецЦикла;
	
	Если СтруктураОтвет.ЕстьОшибка = Истина тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ПолучитьСтруктуруДляВыгрузки(Партнер)
	СтруктураВыгрузка = Новый Структура;
	СтруктураВыгрузка.Вставить("СтруктураПартнер", ПолучитьСтруктуруПартнер(Партнер));
	СтруктураВыгрузка.Вставить("ТЗКонтактныеЛицаПартнеров", ПолучитьТЗКонтактныеЛицаПартнеров(Партнер));
	СтруктураВыгрузка.Вставить("ТЗКонтрагенты", ПолучитьТЗКонтрагентыПартнера(Партнер));
	
	Возврат СтруктураВыгрузка;
КонецФункции

Функция ПолучитьСтруктуруПартнер(Партнер)
	СтруктураПартнер = Новый Структура;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//шапка
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Партнер);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Партнеры.Наименование КАК Наименование,
	               |	Партнеры.БизнесРегион.Наименование КАК БизнесРегионНаименование,
	               |	Партнеры.ВариантОтправкиЭлектронногоЧека КАК ВариантОтправкиЭлектронногоЧека,
	               |	Партнеры.ДатаРегистрации КАК ДатаРегистрации,
	               |	Партнеры.ДатаРождения КАК ДатаРождения,
	               |	Партнеры.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	               |	Партнеры.Клиент КАК Клиент,
	               |	Партнеры.Конкурент КАК Конкурент,
	               |	Партнеры.ОбслуживаетсяТорговымиПредставителями КАК ОбслуживаетсяТорговымиПредставителями,
	               |	Партнеры.НаименованиеПолное КАК НаименованиеПолное,
	               |	Партнеры.Перевозчик КАК Перевозчик,
	               |	Партнеры.Пол КАК Пол,
	               |	Партнеры.Поставщик КАК Поставщик,
	               |	Партнеры.ПрочиеОтношения КАК ПрочиеОтношения,
	               |	Партнеры.ЮрФизЛицо КАК ЮрФизЛицо
	               |ИЗ
	               |	Справочник.Партнеры КАК Партнеры
	               |ГДЕ
	               |	Партнеры.Ссылка = &Ссылка";
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	ВыборкаШапка.Следующий();
	
	СтруктураПартнер.Вставить("УИД_Выгрузка", Строка(Партнер.УникальныйИдентификатор()));
	СтруктураПартнер.Вставить("Наименование", ВыборкаШапка.Наименование);
	СтруктураПартнер.Вставить("БизнесРегионСтрока", ВыборкаШапка.БизнесРегионНаименование);
	СтруктураПартнер.Вставить("ВариантОтправкиЭлектронногоЧекаСтрока", Строка(ВыборкаШапка.ВариантОтправкиЭлектронногоЧека));
	СтруктураПартнер.Вставить("ДатаРегистрации", ВыборкаШапка.ДатаРегистрации);
	СтруктураПартнер.Вставить("ДатаРождения", ВыборкаШапка.ДатаРождения);
	СтруктураПартнер.Вставить("ДополнительнаяИнформация", ВыборкаШапка.ДополнительнаяИнформация);
	СтруктураПартнер.Вставить("Клиент", ВыборкаШапка.Клиент);
	СтруктураПартнер.Вставить("Конкурент", ВыборкаШапка.Конкурент);
	СтруктураПартнер.Вставить("ОбслуживаетсяТорговымиПредставителями", ВыборкаШапка.ОбслуживаетсяТорговымиПредставителями);
	СтруктураПартнер.Вставить("НаименованиеПолное", ВыборкаШапка.НаименованиеПолное);
	СтруктураПартнер.Вставить("Перевозчик", ВыборкаШапка.Перевозчик);
	СтруктураПартнер.Вставить("ПолСтрока", XMLСтрока(ВыборкаШапка.Пол));
	СтруктураПартнер.Вставить("Поставщик", ВыборкаШапка.Поставщик);
	СтруктураПартнер.Вставить("ПрочиеОтношения", ВыборкаШапка.ПрочиеОтношения);
	СтруктураПартнер.Вставить("ЮрФизЛицоСтрока", XMLСтрока(ВыборкаШапка.ЮрФизЛицо));
	
	//контактная информация
	ЗапросКонтактнаяИнформация = Новый Запрос;
	ЗапросКонтактнаяИнформация.УстановитьПараметр("Ссылка", Партнер);
	ЗапросКонтактнаяИнформация.Текст = "ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Тип КАК ТипПеречисление,
	|	ПартнерыКонтактнаяИнформация.Вид.Наименование КАК ВидСтрока,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
	|	ПартнерыКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	ПартнерыКонтактнаяИнформация.Страна КАК Страна,
	|	ПартнерыКонтактнаяИнформация.Регион КАК Регион,
	|	ПартнерыКонтактнаяИнформация.Город КАК Город,
	|	ПартнерыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	ПартнерыКонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	ПартнерыКонтактнаяИнформация.ВидДляСписка.Наименование КАК ВидДляСпискаСтрока,
	|	ПартнерыКонтактнаяИнформация.Значение КАК Значение
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПартнерыКонтактнаяИнформация.НомерСтроки
	|";

	
	РезультатКонтактнаяИнформация = ЗапросКонтактнаяИнформация.Выполнить();
	
	Если РезультатКонтактнаяИнформация.Пустой() тогда
		СтруктураПартнер.Вставить("ТЗКонтактнаяИнформацияПартнер", Неопределено);
	Иначе
		ТЗКонтактнаяИнформацияПартнер = РезультатКонтактнаяИнформация.Выгрузить();
		
		ТЗКонтактнаяИнформацияПартнер.Колонки.Добавить("ТипСтрока", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
		
		Для каждого стр из ТЗКонтактнаяИнформацияПартнер цикл
			стр.ТипСтрока = XMLСтрока(стр.ТипПеречисление);
		КонецЦикла;
		
		ТЗКонтактнаяИнформацияПартнер.Колонки.Удалить("ТипПеречисление");
		
		СтруктураПартнер.Вставить("ТЗКонтактнаяИнформацияПартнер", ТЗКонтактнаяИнформацияПартнер);
	КонецЕсли;
	
	Возврат СтруктураПартнер;
КонецФункции

Функция ПолучитьТЗКонтактныеЛицаПартнеров(Партнер)
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтруктураКонтактноеЛицо", Новый ОписаниеТипов("Структура"));
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактныеЛицаПартнеров.Наименование КАК Наименование,
	|	КонтактныеЛицаПартнеров.ДатаПрекращенияСвязи КАК ДатаПрекращенияСвязи,
	|	КонтактныеЛицаПартнеров.ДатаРегистрацииСвязи КАК ДатаРегистрацииСвязи,
	|	КонтактныеЛицаПартнеров.ДатаРождения КАК ДатаРождения,
	|	КонтактныеЛицаПартнеров.ДолжностьПоВизитке КАК ДолжностьПоВизитке,
	|	КонтактныеЛицаПартнеров.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	КонтактныеЛицаПартнеров.Комментарий КАК Комментарий,
	|	КонтактныеЛицаПартнеров.Пол КАК ПолПеречисление,
	|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Владелец = &Партнер
	|	И КонтактныеЛицаПартнеров.ПометкаУдаления = ЛОЖЬ
	|";      
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		СтруктураКонтактноеЛицо = Новый Структура;
		СтруктураКонтактноеЛицо.Вставить("Наименование", Выборка.Наименование);
		СтруктураКонтактноеЛицо.Вставить("ДатаПрекращенияСвязи", Выборка.ДатаПрекращенияСвязи);
		СтруктураКонтактноеЛицо.Вставить("ДатаРегистрацииСвязи", Выборка.ДатаРегистрацииСвязи);
		СтруктураКонтактноеЛицо.Вставить("ДатаРождения", Выборка.ДатаРождения);
		СтруктураКонтактноеЛицо.Вставить("ДолжностьПоВизитке", Выборка.ДолжностьПоВизитке);
		СтруктураКонтактноеЛицо.Вставить("ДополнительнаяИнформация", Выборка.ДополнительнаяИнформация);
		СтруктураКонтактноеЛицо.Вставить("Комментарий", Выборка.Комментарий);
		СтруктураКонтактноеЛицо.Вставить("ПолСтрока", XMLСтрока(Выборка.ПолПеречисление));
		
		//контактная информация
		ЗапросКонтактнаяИнформация = Новый Запрос;
		ЗапросКонтактнаяИнформация.УстановитьПараметр("Ссылка", Выборка.Ссылка);
		ЗапросКонтактнаяИнформация.Текст = "ВЫБРАТЬ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип КАК ТипПеречисление,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид.Наименование КАК ВидСтрока,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК Представление,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Страна КАК Страна,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Регион КАК Регион,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Город КАК Город,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.ВидДляСписка.Наименование КАК ВидДляСпискаСтрока,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Значение КАК Значение
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерСтроки
		|";
		
		РезультатКонтактнаяИнформация = ЗапросКонтактнаяИнформация.Выполнить();
		
		Если РезультатКонтактнаяИнформация.Пустой() тогда
			СтруктураКонтактноеЛицо.Вставить("ТЗКонтактнаяИнформация", Неопределено);
		Иначе
			ТЗКонтактнаяИнформация = РезультатКонтактнаяИнформация.Выгрузить();
			
			ТЗКонтактнаяИнформация.Колонки.Добавить("ТипСтрока", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
			
			Для каждого стр из ТЗКонтактнаяИнформация цикл
				стр.ТипСтрока = XMLСтрока(стр.ТипПеречисление);
			КонецЦикла;
			
			ТЗКонтактнаяИнформация.Колонки.Удалить("ТипПеречисление");
			
			СтруктураКонтактноеЛицо.Вставить("ТЗКонтактнаяИнформация", ТЗКонтактнаяИнформация);

		КонецЕсли;
		
		НовСтр = ТЗ.Добавить();
		НовСтр.СтруктураКонтактноеЛицо = СтруктураКонтактноеЛицо;

	КонецЦикла;
	
	Возврат ТЗ;

КонецФункции

Функция ПолучитьТЗКонтрагентыПартнера(Партнер)
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтруктураКонтрагент", Новый ОписаниеТипов("Структура"));
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.КодПоОКПО КАК КодПоОКПО,
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	|	Контрагенты.НаименованиеМеждународное КАК НаименованиеМеждународное,
	|	Контрагенты.НалоговыйНомер КАК НалоговыйНомер,
	|	Контрагенты.НДСПоСтавкам4и2 КАК НДСПоСтавкам4и2,
	|	Контрагенты.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Контрагенты.РегистрационныйНомер КАК РегистрационныйНомер,
	|	Контрагенты.СтранаРегистрации.Наименование КАК СтранаРегистрацииСтрока,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицоПеречисление,
	|	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицоПеречисление,
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
    |ГДЕ
    |	Контрагенты.ПометкаУдаления = ЛОЖЬ
    |	И Контрагенты.Партнер = &Партнер
    //++ смарт:Подкин # 14.02.2022 13:17:00
    |    И Контрагенты.ИНН <> """"";
    //-- смарт:Подкин # 14.02.2022 13:17:00
    
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		СтруктураКонтрагент = Новый Структура;
		СтруктураКонтрагент.Вставить("Наименование", Выборка.Наименование);
		СтруктураКонтрагент.Вставить("ДополнительнаяИнформация", Выборка.ДополнительнаяИнформация);
		СтруктураКонтрагент.Вставить("ИНН", Выборка.ИНН);
		СтруктураКонтрагент.Вставить("КПП", Выборка.КПП);
		СтруктураКонтрагент.Вставить("КодПоОКПО", Выборка.КодПоОКПО);
		СтруктураКонтрагент.Вставить("НаименованиеПолное", Выборка.НаименованиеПолное);
		СтруктураКонтрагент.Вставить("НаименованиеМеждународное", Выборка.НаименованиеМеждународное);
		СтруктураКонтрагент.Вставить("НалоговыйНомер", Выборка.НалоговыйНомер);
		СтруктураКонтрагент.Вставить("НДСПоСтавкам4и2", Выборка.НДСПоСтавкам4и2);
		СтруктураКонтрагент.Вставить("ОбособленноеПодразделение", Выборка.ОбособленноеПодразделение);
		СтруктураКонтрагент.Вставить("РегистрационныйНомер", Выборка.РегистрационныйНомер);
		СтруктураКонтрагент.Вставить("СтранаРегистрацииСтрока", Выборка.СтранаРегистрацииСтрока);
		СтруктураКонтрагент.Вставить("ЮридическоеФизическоеЛицоСтрока", XMLСтрока(Выборка.ЮридическоеФизическоеЛицоПеречисление));
		СтруктураКонтрагент.Вставить("ЮрФизЛицоСтрока", XMLСтрока(Выборка.ЮрФизЛицоПеречисление));
		
		//контактная информация
		ЗапросКонтактнаяИнформация = Новый Запрос;
		ЗапросКонтактнаяИнформация.УстановитьПараметр("Ссылка", Выборка.Ссылка);
		ЗапросКонтактнаяИнформация.Текст = "ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Тип КАК ТипПеречисление,
		|	КонтрагентыКонтактнаяИнформация.Вид.Наименование КАК ВидСтрока,
		|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
		|	КонтрагентыКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	КонтрагентыКонтактнаяИнформация.Страна КАК Страна,
		|	КонтрагентыКонтактнаяИнформация.Регион КАК Регион,
		|	КонтрагентыКонтактнаяИнформация.Город КАК Город,
		|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	КонтрагентыКонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
		|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтрагентыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
		|	КонтрагентыКонтактнаяИнформация.ВидДляСписка.Наименование КАК ВидДляСпискаСтрока,
		|	КонтрагентыКонтактнаяИнформация.Значение КАК Значение
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтрагентыКонтактнаяИнформация.НомерСтроки
		|";		
		РезультатКонтактнаяИнформация = ЗапросКонтактнаяИнформация.Выполнить();
		
		Если РезультатКонтактнаяИнформация.Пустой() тогда
			СтруктураКонтрагент.Вставить("ТЗКонтактнаяИнформация", Неопределено);
		Иначе
			ТЗКонтактнаяИнформация = РезультатКонтактнаяИнформация.Выгрузить();
			
			ТЗКонтактнаяИнформация.Колонки.Добавить("ТипСтрока", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
			
			Для каждого стр из ТЗКонтактнаяИнформация цикл
				стр.ТипСтрока = XMLСтрока(стр.ТипПеречисление);
			КонецЦикла;
			
			ТЗКонтактнаяИнформация.Колонки.Удалить("ТипПеречисление");
			
			СтруктураКонтрагент.Вставить("ТЗКонтактнаяИнформация", ТЗКонтактнаяИнформация);

		КонецЕсли;
		
		//банковские счета
		ЗапросСчета = Новый Запрос;
		ЗапросСчета.УстановитьПараметр("Контрагент", Выборка.Ссылка);
		ЗапросСчета.Текст = "ВЫБРАТЬ
		|	БанковскиеСчетаКонтрагентов.Наименование КАК Наименование,
		|	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета,
		|	БанковскиеСчетаКонтрагентов.АдресБанка КАК АдресБанка,
		|	БанковскиеСчетаКонтрагентов.АдресБанкаДляРасчетов КАК АдресБанкаДляРасчетов,
		|	БанковскиеСчетаКонтрагентов.АдресБанкаМеждународный КАК АдресБанкаМеждународный,
		|	БанковскиеСчетаКонтрагентов.Банк.Код КАК БанкКод,
		|	БанковскиеСчетаКонтрагентов.БанкДляРасчетов.Код КАК БанкДляРасчетовКод,
		|	БанковскиеСчетаКонтрагентов.БИКБанка КАК БИКБанка,
		|	БанковскиеСчетаКонтрагентов.БИКБанкаДляРасчетов КАК БИКБанкаДляРасчетов,
		|	БанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств.Код КАК ВалютаДенежныхСредствКод,
		|	БанковскиеСчетаКонтрагентов.ГородБанка КАК ГородБанка,
		|	БанковскиеСчетаКонтрагентов.ГородБанкаДляРасчетов КАК ГородБанкаДляРасчетов,
		|	БанковскиеСчетаКонтрагентов.ГородБанкаМеждународный КАК ГородБанкаМеждународный,
		|	БанковскиеСчетаКонтрагентов.ГородБанкаДляРасчетовМеждународный КАК ГородБанкаДляРасчетовМеждународный,
		|	БанковскиеСчетаКонтрагентов.ГосударственныйКонтракт КАК ГосударственныйКонтракт,
		|	БанковскиеСчетаКонтрагентов.Закрыт КАК Закрыт,
		|	БанковскиеСчетаКонтрагентов.ИННКорреспондента КАК ИННКорреспондента,
		|	БанковскиеСчетаКонтрагентов.ИностранныйБанк КАК ИностранныйБанк,
		|	БанковскиеСчетаКонтрагентов.КоррСчетБанка КАК КоррСчетБанка,
		|	БанковскиеСчетаКонтрагентов.КоррСчетБанкаДляРасчетов КАК КоррСчетБанкаДляРасчетов,
		|	БанковскиеСчетаКонтрагентов.КППКорреспондента КАК КППКорреспондента,
		|	БанковскиеСчетаКонтрагентов.НаименованиеБанка КАК НаименованиеБанка,
		|	БанковскиеСчетаКонтрагентов.НаименованиеБанкаДляРасчетов КАК НаименованиеБанкаДляРасчетов,
		|	БанковскиеСчетаКонтрагентов.НаименованиеБанкаМеждународное КАК НаименованиеБанкаМеждународное,
		|	БанковскиеСчетаКонтрагентов.НаименованиеБанкаДляРасчетовМеждународное КАК НаименованиеБанкаДляРасчетовМеждународное,
		|	БанковскиеСчетаКонтрагентов.ОтдельныйСчетГОЗ КАК ОтдельныйСчетГОЗ,
		|	БанковскиеСчетаКонтрагентов.РучноеИзменениеРеквизитовБанка КАК РучноеИзменениеРеквизитовБанка,
		|	БанковскиеСчетаКонтрагентов.РучноеИзменениеРеквизитовБанкаДляРасчетов КАК РучноеИзменениеРеквизитовБанкаДляРасчетов,
		|	БанковскиеСчетаКонтрагентов.СВИФТБанка КАК СВИФТБанка,
		|	БанковскиеСчетаКонтрагентов.СВИФТБанкаДляРасчетов КАК СВИФТБанкаДляРасчетов,
		|	БанковскиеСчетаКонтрагентов.СтранаБанка.Наименование КАК СтранаБанкаСтрока,
		|	БанковскиеСчетаКонтрагентов.СтранаБанкаДляРасчетов.Наименование КАК СтранаБанкаДляРасчетовСтрока,
		|	БанковскиеСчетаКонтрагентов.СчетВБанкеДляРасчетов КАК СчетВБанкеДляРасчетов,
		|	БанковскиеСчетаКонтрагентов.ТелефоныБанка КАК ТелефоныБанка,
		|	БанковскиеСчетаКонтрагентов.ТелефоныБанкаДляРасчетов КАК ТелефоныБанкаДляРасчетов
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
		|ГДЕ
		|	БанковскиеСчетаКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И БанковскиеСчетаКонтрагентов.Владелец = &Контрагент
		|";

		РезультатСчет = ЗапросСчета.Выполнить();
		
		Если РезультатСчет.Пустой() тогда
			СтруктураКонтрагент.Вставить("ТЗБанковскиеСчета", Неопределено);
		Иначе
			ТЗБанковскиеСчета = РезультатСчет.Выгрузить();
			СтруктураКонтрагент.Вставить("ТЗБанковскиеСчета", ТЗБанковскиеСчета);
		КонецЕсли;
		
		НовСтр = ТЗ.Добавить();
		НовСтр.СтруктураКонтрагент = СтруктураКонтрагент;
	КонецЦикла;
	
	Возврат ТЗ;
КонецФункции

Функция Сериализовать(ОбъектСериализации)
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	ФайлXML = Новый ЗаписьXML;
	ФайлXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ФайлXML, ОбъектXDTO);
	Возврат ФайлXML.Закрыть();
КонецФункции

Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
    ЧтениеXMLДанных = Новый ЧтениеXML;
    ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
    СтруктураВозврата = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
    ЧтениеXMLДанных.Закрыть();  
    Возврат СтруктураВозврата;
КонецФункции

Функция ЕстьКонтрагентыПоПартнеру(Партнер) Экспорт
	ЕстьКонтрагенты = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ПометкаУдаления = ЛОЖЬ
	               |	И Контрагенты.Партнер = &Партнер";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		ЕстьКонтрагенты = Истина;
	КонецЕсли;
	
	Возврат ЕстьКонтрагенты;
КонецФункции
